{
  "format": "layers-model",
  "generatedBy": "keras v2.2.4-tf",
  "convertedBy": "TensorFlow.js Converter v3.11.0",
  "modelTopology": {
    "keras_version": "2.2.4-tf",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Model",
      "config": {
        "name": "model",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 224, 224, 3],
              "dtype": "float32",
              "sparse": false,
              "name": "input_1"
            },
            "name": "input_1",
            "inbound_nodes": []
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "block1_conv1",
              "trainable": false,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "block1_conv1",
            "inbound_nodes": [[["input_1", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "block1_conv2",
              "trainable": false,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "block1_conv2",
            "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "block1_pool",
              "trainable": false,
              "dtype": "float32",
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2],
              "data_format": "channels_last"
            },
            "name": "block1_pool",
            "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "block2_conv1",
              "trainable": false,
              "dtype": "float32",
              "filters": 128,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "block2_conv1",
            "inbound_nodes": [[["block1_pool", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "block2_conv2",
              "trainable": false,
              "dtype": "float32",
              "filters": 128,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "block2_conv2",
            "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "block2_pool",
              "trainable": false,
              "dtype": "float32",
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2],
              "data_format": "channels_last"
            },
            "name": "block2_pool",
            "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "block3_conv1",
              "trainable": false,
              "dtype": "float32",
              "filters": 256,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "block3_conv1",
            "inbound_nodes": [[["block2_pool", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "block3_conv2",
              "trainable": false,
              "dtype": "float32",
              "filters": 256,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "block3_conv2",
            "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "block3_conv3",
              "trainable": false,
              "dtype": "float32",
              "filters": 256,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "block3_conv3",
            "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "block3_pool",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2],
              "data_format": "channels_last"
            },
            "name": "block3_pool",
            "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "block4_conv1",
              "trainable": true,
              "dtype": "float32",
              "filters": 512,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "block4_conv1",
            "inbound_nodes": [[["block3_pool", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "block4_conv2",
              "trainable": true,
              "dtype": "float32",
              "filters": 512,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "block4_conv2",
            "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "block4_conv3",
              "trainable": true,
              "dtype": "float32",
              "filters": 512,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "block4_conv3",
            "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "block4_pool",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2],
              "data_format": "channels_last"
            },
            "name": "block4_pool",
            "inbound_nodes": [[["block4_conv3", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "block5_conv1",
              "trainable": true,
              "dtype": "float32",
              "filters": 512,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "block5_conv1",
            "inbound_nodes": [[["block4_pool", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "block5_conv2",
              "trainable": true,
              "dtype": "float32",
              "filters": 512,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "block5_conv2",
            "inbound_nodes": [[["block5_conv1", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "block5_conv3",
              "trainable": true,
              "dtype": "float32",
              "filters": 512,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "block5_conv3",
            "inbound_nodes": [[["block5_conv2", 0, 0, {}]]]
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "block5_pool",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2],
              "data_format": "channels_last"
            },
            "name": "block5_pool",
            "inbound_nodes": [[["block5_conv3", 0, 0, {}]]]
          },
          {
            "class_name": "GlobalAveragePooling2D",
            "config": {
              "name": "global_average_pooling2d",
              "trainable": true,
              "dtype": "float32",
              "data_format": "channels_last"
            },
            "name": "global_average_pooling2d",
            "inbound_nodes": [[["block5_pool", 0, 0, {}]]]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "dtype": "float32",
              "units": 1024,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense",
            "inbound_nodes": [[["global_average_pooling2d", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization",
              "trainable": true,
              "dtype": "float32",
              "axis": [1],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization",
            "inbound_nodes": [[["dense", 0, 0, {}]]]
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.4,
              "noise_shape": null,
              "seed": null
            },
            "name": "dropout",
            "inbound_nodes": [[["batch_normalization", 0, 0, {}]]]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": "float32",
              "units": 6,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense_1",
            "inbound_nodes": [[["dropout", 0, 0, {}]]]
          }
        ],
        "input_layers": [["input_1", 0, 0]],
        "output_layers": [["dense_1", 0, 0]]
      }
    },
    "training_config": {
      "loss": "categorical_crossentropy",
      "metrics": ["accuracy"],
      "weighted_metrics": null,
      "sample_weight_mode": null,
      "loss_weights": null,
      "optimizer_config": {
        "class_name": "Adam",
        "config": {
          "name": "Adam",
          "learning_rate": 2.499999936844688e-5,
          "decay": 0.0,
          "beta_1": 0.8999999761581421,
          "beta_2": 0.9990000128746033,
          "epsilon": 1e-7,
          "amsgrad": false
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of15.bin",
        "group1-shard2of15.bin",
        "group1-shard3of15.bin",
        "group1-shard4of15.bin",
        "group1-shard5of15.bin",
        "group1-shard6of15.bin",
        "group1-shard7of15.bin",
        "group1-shard8of15.bin",
        "group1-shard9of15.bin",
        "group1-shard10of15.bin",
        "group1-shard11of15.bin",
        "group1-shard12of15.bin",
        "group1-shard13of15.bin",
        "group1-shard14of15.bin",
        "group1-shard15of15.bin"
      ],
      "weights": [
        {
          "name": "batch_normalization/gamma",
          "shape": [1024],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization/beta",
          "shape": [1024],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization/moving_mean",
          "shape": [1024],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization/moving_variance",
          "shape": [1024],
          "dtype": "float32"
        },
        {
          "name": "block1_conv1/kernel",
          "shape": [3, 3, 3, 64],
          "dtype": "float32"
        },
        { "name": "block1_conv1/bias", "shape": [64], "dtype": "float32" },
        {
          "name": "block1_conv2/kernel",
          "shape": [3, 3, 64, 64],
          "dtype": "float32"
        },
        { "name": "block1_conv2/bias", "shape": [64], "dtype": "float32" },
        {
          "name": "block2_conv1/kernel",
          "shape": [3, 3, 64, 128],
          "dtype": "float32"
        },
        { "name": "block2_conv1/bias", "shape": [128], "dtype": "float32" },
        {
          "name": "block2_conv2/kernel",
          "shape": [3, 3, 128, 128],
          "dtype": "float32"
        },
        { "name": "block2_conv2/bias", "shape": [128], "dtype": "float32" },
        {
          "name": "block3_conv1/kernel",
          "shape": [3, 3, 128, 256],
          "dtype": "float32"
        },
        { "name": "block3_conv1/bias", "shape": [256], "dtype": "float32" },
        {
          "name": "block3_conv2/kernel",
          "shape": [3, 3, 256, 256],
          "dtype": "float32"
        },
        { "name": "block3_conv2/bias", "shape": [256], "dtype": "float32" },
        {
          "name": "block3_conv3/kernel",
          "shape": [3, 3, 256, 256],
          "dtype": "float32"
        },
        { "name": "block3_conv3/bias", "shape": [256], "dtype": "float32" },
        {
          "name": "block4_conv1/kernel",
          "shape": [3, 3, 256, 512],
          "dtype": "float32"
        },
        { "name": "block4_conv1/bias", "shape": [512], "dtype": "float32" },
        {
          "name": "block4_conv2/kernel",
          "shape": [3, 3, 512, 512],
          "dtype": "float32"
        },
        { "name": "block4_conv2/bias", "shape": [512], "dtype": "float32" },
        {
          "name": "block4_conv3/kernel",
          "shape": [3, 3, 512, 512],
          "dtype": "float32"
        },
        { "name": "block4_conv3/bias", "shape": [512], "dtype": "float32" },
        {
          "name": "block5_conv1/kernel",
          "shape": [3, 3, 512, 512],
          "dtype": "float32"
        },
        { "name": "block5_conv1/bias", "shape": [512], "dtype": "float32" },
        {
          "name": "block5_conv2/kernel",
          "shape": [3, 3, 512, 512],
          "dtype": "float32"
        },
        { "name": "block5_conv2/bias", "shape": [512], "dtype": "float32" },
        {
          "name": "block5_conv3/kernel",
          "shape": [3, 3, 512, 512],
          "dtype": "float32"
        },
        { "name": "block5_conv3/bias", "shape": [512], "dtype": "float32" },
        { "name": "dense/kernel", "shape": [512, 1024], "dtype": "float32" },
        { "name": "dense/bias", "shape": [1024], "dtype": "float32" },
        { "name": "dense_1/kernel", "shape": [1024, 6], "dtype": "float32" },
        { "name": "dense_1/bias", "shape": [6], "dtype": "float32" }
      ]
    }
  ]
}
